h2zero/n-able-Arduino/boards.txt
BLENano2.upload.tool=openocd
BLENano2.upload.protocol=cmsis-dap
BLENano2.upload.target=nrf52
BLENano2.upload.maximum_size=524288
BLENano2.upload.setup_command=transport select swd;

BLENano2.bootloader.tool=openocd

BLENano2.build.mcu=cortex-m4
BLENano2.build.f_cpu=64000000
BLENano2.build.board=RB_BLE_NANO_2
BLENano2.build.core=nRF5
BLENano2.build.variant=RedBear_BLENano2
BLENano2.build.variant_system_lib=
BLENano2.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BLENano2.build.ldscript=nrf52_xxaa.ld
BLENano2.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BLENano2.menu.role.all=All
BLENano2.menu.role.all.build.nimble_flags=
BLENano2.menu.role.periph=Peripheral
BLENano2.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano2.menu.role.adv=Advertiser
BLENano2.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano2.menu.role.scan=Scanner
BLENano2.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano2.menu.role.central=Client
BLENano2.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano2.menu.cppDbgLvl.none=None
BLENano2.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano2.menu.cppDbgLvl.error=Error
BLENano2.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano2.menu.cppDbgLvl.warn=Warn
BLENano2.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano2.menu.cppDbgLvl.info=Info
BLENano2.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano2.menu.cppDbgLvl.debug=Debug
BLENano2.menu.cppDbgLvl.debug.build.cpp_debug=4


# nRF52840 variants
###################

Generic_nRF52840.name=Generic nRF52840

Generic_nRF52840.upload.tool=openocd
Generic_nRF52840.upload.target=nrf52
Generic_nRF52840.upload.maximum_size=1048576

Generic_nRF52840.bootloader.tool=openocd

Generic_nRF52840.build.mcu=cortex-m4
Generic_nRF52840.build.f_cpu=64000000
Generic_nRF52840.build.board=GENERIC
Generic_nRF52840.build.core=nRF5
Generic_nRF52840.build.variant=Generic
Generic_nRF52840.build.variant_system_lib=
Generic_nRF52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
Generic_nRF52840.build.ldscript=nrf52840_xxaa.ld
Generic_nRF52840.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA {build.lfclk_flags} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Generic_nRF52840.menu.lfclk.lfxo=Crystal Oscillator
Generic_nRF52840.menu.lfclk.lfxo.build.lfclk_flags=-DUSE_LFXO
Generic_nRF52840.menu.lfclk.lfrc=RC Oscillator
Generic_nRF52840.menu.lfclk.lfrc.build.lfclk_flags=-DUSE_LFRC
Generic_nRF52840.menu.lfclk.lfsynt=Synthesized
Generic_nRF52840.menu.lfclk.lfsynt.build.lfclk_flags=-DUSE_LFSYNT

Generic_nRF52840.menu.role.all=All
Generic_nRF52840.menu.role.all.build.nimble_flags=
Generic_nRF52840.menu.role.periph=Peripheral
Generic_nRF52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Generic_nRF52840.menu.role.adv=Advertiser
Generic_nRF52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Generic_nRF52840.menu.role.scan=Scanner
Generic_nRF52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Generic_nRF52840.menu.role.central=Client
Generic_nRF52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Generic_nRF52840.menu.cppDbgLvl.none=None
Generic_nRF52840.menu.cppDbgLvl.none.build.cpp_debug=0
Generic_nRF52840.menu.cppDbgLvl.error=Error
Generic_nRF52840.menu.cppDbgLvl.error.build.cpp_debug=1
Generic_nRF52840.menu.cppDbgLvl.warn=Warn
Generic_nRF52840.menu.cppDbgLvl.warn.build.cpp_debug=2
Generic_nRF52840.menu.cppDbgLvl.info=Info
Generic_nRF52840.menu.cppDbgLvl.info.build.cpp_debug=3
Generic_nRF52840.menu.cppDbgLvl.debug=Debug
Generic_nRF52840.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF52840_DK.name=Nordic nRF52840 DK
nRF52840_DK.vid.0=0x1366
nRF52840_DK.pid.0=0x1015

nRF52840_DK.upload.tool=openocd
nRF52840_DK.upload.protocol=jlink
nRF52840_DK.upload.target=nrf52
nRF52840_DK.upload.maximum_size=1048576
nRF52840_DK.upload.setup_command=transport select swd;

nRF52840_DK.bootloader.tool=openocd

nRF52840_DK.build.mcu=cortex-m4
nRF52840_DK.build.f_cpu=64000000
nRF52840_DK.build.board=NRF52840_DK
nRF52840_DK.build.core=nRF5
nRF52840_DK.build.variant=nRF52840_DK
nRF52840_DK.build.variant_system_lib=
nRF52840_DK.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_DK.build.ldscript=nrf52840_xxaa.ld
nRF52840_DK.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF52840_DK.menu.role.all=All
nRF52840_DK.menu.role.all.build.nimble_flags=
nRF52840_DK.menu.role.periph=Peripheral
nRF52840_DK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_DK.menu.role.adv=Advertiser
nRF52840_DK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_DK.menu.role.scan=Scanner
nRF52840_DK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_DK.menu.role.central=Client
nRF52840_DK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_DK.menu.cppDbgLvl.none=None
nRF52840_DK.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_DK.menu.cppDbgLvl.error=Error
nRF52840_DK.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_DK.menu.cppDbgLvl.warn=Warn
nRF52840_DK.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_DK.menu.cppDbgLvl.info=Info
nRF52840_DK.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_DK.menu.cppDbgLvl.debug=Debug
nRF52840_DK.menu.cppDbgLvl.debug.build.cpp_debug=4


