h2zero/n-able-Arduino/boards.txt
nRF52840_dongle.name=nRF52840_dongle

nRF52840_dongle.vid.0=0x1915
nRF52840_dongle.pid.0=0x521B
nRF52840_dongle.vid.1=0x1915
nRF52840_dongle.pid.1=0x521F

nRF52840_dongle.upload.tool=nrfutil
nRF52840_dongle.upload.target=nrf52
nRF52840_dongle.upload.protocol=nrfutil
nRF52840_dongle.upload.maximum_size=913408

nRF52840_dongle.bootloader.tool=nrfutil

nRF52840_dongle.build.mcu=cortex-m4
nRF52840_dongle.build.f_cpu=64000000
nRF52840_dongle.build.board=NRF52840_DONGLE
nRF52840_dongle.build.core=nRF5
nRF52840_dongle.build.variant=nRF52840_Dongle
nRF52840_dongle.build.variant_system_lib=
nRF52840_dongle.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
nRF52840_dongle.build.ldscript=nrf52840_dongle.ld
nRF52840_dongle.build.vid=0x1915
nRF52840_dongle.build.pid=0x521B
nRF52840_dongle.build.usb_manufacturer="Nordic Semiconductor"
nRF52840_dongle.build.usb_product="nRF52840 Dongle"
nRF52840_dongle.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_NORDIC_BL {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
nRF52840_dongle.build.dfu_pattern={nrfutil.dfu_pattern}

nRF52840_dongle.menu.role.all=All
nRF52840_dongle.menu.role.all.build.nimble_flags=
nRF52840_dongle.menu.role.periph=Peripheral
nRF52840_dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF52840_dongle.menu.role.adv=Advertiser
nRF52840_dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF52840_dongle.menu.role.scan=Scanner
nRF52840_dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF52840_dongle.menu.role.central=Client
nRF52840_dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF52840_dongle.menu.cppDbgLvl.none=None
nRF52840_dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF52840_dongle.menu.cppDbgLvl.error=Error
nRF52840_dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF52840_dongle.menu.cppDbgLvl.warn=Warn
nRF52840_dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF52840_dongle.menu.cppDbgLvl.info=Info
nRF52840_dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF52840_dongle.menu.cppDbgLvl.debug=Debug
nRF52840_dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


BT5040.name=E104-BT5040

BT5040.vid.0=0x1915
BT5040.pid.0=0x521B
BT5040.vid.1=0x1915
BT5040.pid.1=0x521F

BT5040.upload.tool=nrfutil
BT5040.upload.target=nrf52
BT5040.upload.protocol=nrfutil
BT5040.upload.maximum_size=913408

BT5040.bootloader.tool=nrfutil

BT5040.build.mcu=cortex-m4
BT5040.build.f_cpu=64000000
BT5040.build.board=BT5040
BT5040.build.core=nRF5
BT5040.build.variant=nRF52840_Dongle
BT5040.build.variant_system_lib=
BT5040.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
BT5040.build.ldscript=nrf52840_dongle.ld
BT5040.build.vid=0x1915
BT5040.build.pid=0x521B
BT5040.build.usb_manufacturer="Ebyte"
BT5040.build.usb_product="E104-BT5040UA"
BT5040.build.extra_flags=-DNRF52_SERIES -DNRF52840_XXAA -DUSE_NORDIC_BL {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
BT5040.build.dfu_pattern={nrfutil.dfu_pattern}

BT5040.menu.role.all=All
BT5040.menu.role.all.build.nimble_flags=
BT5040.menu.role.periph=Peripheral
BT5040.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BT5040.menu.role.adv=Advertiser
BT5040.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BT5040.menu.role.scan=Scanner
BT5040.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BT5040.menu.role.central=Client
BT5040.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BT5040.menu.cppDbgLvl.none=None
BT5040.menu.cppDbgLvl.none.build.cpp_debug=0
BT5040.menu.cppDbgLvl.error=Error
BT5040.menu.cppDbgLvl.error.build.cpp_debug=1
BT5040.menu.cppDbgLvl.warn=Warn
BT5040.menu.cppDbgLvl.warn.build.cpp_debug=2
BT5040.menu.cppDbgLvl.info=Info
BT5040.menu.cppDbgLvl.info.build.cpp_debug=3
BT5040.menu.cppDbgLvl.debug=Debug
BT5040.menu.cppDbgLvl.debug.build.cpp_debug=4


feather52840.name=Adafruit Feather nRF52840 Express

feather52840.vid.0=0x239A
feather52840.pid.0=0x8029
feather52840.vid.1=0x239A
feather52840.pid.1=0x0029
feather52840.vid.2=0x239A
feather52840.pid.2=0x002A
feather52840.vid.3=0x239A
feather52840.pid.3=0x802A

feather52840.upload.tool=openocd
feather52840.upload.target=nrf52
feather52840.upload.use_1200bps_touch=true
feather52840.upload.wait_for_upload_port=true
feather52840.upload.maximum_size=995328

feather52840.bootloader.tool=openocd

feather52840.build.mcu=cortex-m4
feather52840.build.f_cpu=64000000
feather52840.build.board=NRF52840_FEATHER
feather52840.build.core=nRF5
feather52840.build.variant=feather_nrf52840_express
feather52840.build.variant_system_lib=
feather52840.build.usb_manufacturer="Adafruit"
feather52840.build.usb_product="Feather nRF52840 Express"
feather52840.build.vid=0x239A
feather52840.build.pid=0x8029
feather52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52840.build.ldscript=nrf52840_xxaa.ld
feather52840.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
feather52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

feather52840.menu.role.all=All
feather52840.menu.role.all.build.nimble_flags=
feather52840.menu.role.periph=Peripheral
feather52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52840.menu.role.adv=Advertiser
feather52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52840.menu.role.scan=Scanner
feather52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52840.menu.role.central=Client
feather52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52840.menu.cppDbgLvl.none=None
feather52840.menu.cppDbgLvl.none.build.cpp_debug=0
feather52840.menu.cppDbgLvl.error=Error
feather52840.menu.cppDbgLvl.error.build.cpp_debug=1
feather52840.menu.cppDbgLvl.warn=Warn
feather52840.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52840.menu.cppDbgLvl.info=Info
feather52840.menu.cppDbgLvl.info.build.cpp_debug=3
feather52840.menu.cppDbgLvl.debug=Debug
feather52840.menu.cppDbgLvl.debug.build.cpp_debug=4

