h2zero/n-able-Arduino/boards.txt
feather52840.menu.bootloader.adafruit=Adafruit (No softdevice)
feather52840.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
feather52840.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
feather52840.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
feather52840.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
feather52840.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
feather52840.menu.bootloader.none=No bootloader
feather52840.menu.bootloader.none.bootloader.flags=
feather52840.menu.bootloader.none.upload.maximum_size=1048576


feather52840sense.name=Adafruit Feather nRF52840 Sense

feather52840sense.vid.0=0x239A
feather52840sense.pid.0=0x8087
feather52840sense.vid.1=0x239A
feather52840sense.pid.1=0x0087
feather52840sense.vid.2=0x239A
feather52840sense.pid.2=0x0088
feather52840sense.vid.3=0x239A
feather52840sense.pid.3=0x8088

feather52840sense.upload.tool=openocd
feather52840sense.upload.target=nrf52
feather52840sense.upload.use_1200bps_touch=true
feather52840sense.upload.wait_for_upload_port=true
feather52840sense.upload.maximum_size=995328

feather52840sense.bootloader.tool=openocd

feather52840sense.build.mcu=cortex-m4
feather52840sense.build.f_cpu=64000000
feather52840sense.build.board=NRF52840_FEATHER_SENSE
feather52840sense.build.core=nRF5
feather52840sense.build.variant=feather_nrf52840_sense
feather52840sense.build.variant_system_lib=
feather52840sense.build.usb_manufacturer="Adafruit"
feather52840sense.build.usb_product="Feather nRF52840 Sense"
feather52840sense.build.vid=0x239A
feather52840sense.build.pid=0x8087
feather52840sense.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
feather52840sense.build.ldscript=nrf52840_xxaa.ld
feather52840sense.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
feather52840sense.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

feather52840sense.menu.role.all=All
feather52840sense.menu.role.all.build.nimble_flags=
feather52840sense.menu.role.periph=Peripheral
feather52840sense.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
feather52840sense.menu.role.adv=Advertiser
feather52840sense.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
feather52840sense.menu.role.scan=Scanner
feather52840sense.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
feather52840sense.menu.role.central=Client
feather52840sense.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

feather52840sense.menu.cppDbgLvl.none=None
feather52840sense.menu.cppDbgLvl.none.build.cpp_debug=0
feather52840sense.menu.cppDbgLvl.error=Error
feather52840sense.menu.cppDbgLvl.error.build.cpp_debug=1
feather52840sense.menu.cppDbgLvl.warn=Warn
feather52840sense.menu.cppDbgLvl.warn.build.cpp_debug=2
feather52840sense.menu.cppDbgLvl.info=Info
feather52840sense.menu.cppDbgLvl.info.build.cpp_debug=3
feather52840sense.menu.cppDbgLvl.debug=Debug
feather52840sense.menu.cppDbgLvl.debug.build.cpp_debug=4

feather52840sense.menu.bootloader.adafruit=Adafruit (No softdevice)
feather52840sense.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
feather52840sense.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
feather52840sense.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
feather52840sense.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
feather52840sense.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
feather52840sense.menu.bootloader.none=No bootloader
feather52840sense.menu.bootloader.none.bootloader.flags=
feather52840sense.menu.bootloader.none.upload.maximum_size=1048576


itsybitsy52840.name=Adafruit ItsyBitsy nRF52840 Express

itsybitsy52840.vid.0=0x239A
itsybitsy52840.pid.0=0x8051
itsybitsy52840.vid.1=0x239A
itsybitsy52840.pid.1=0x0051
itsybitsy52840.vid.2=0x239A
itsybitsy52840.pid.2=0x0052
itsybitsy52840.vid.3=0x239A
itsybitsy52840.pid.3=0x8052

itsybitsy52840.upload.tool=openocd
itsybitsy52840.upload.target=nrf52
itsybitsy52840.upload.use_1200bps_touch=true
itsybitsy52840.upload.wait_for_upload_port=true
itsybitsy52840.upload.maximum_size=995328

itsybitsy52840.bootloader.tool=openocd

itsybitsy52840.build.mcu=cortex-m4
itsybitsy52840.build.f_cpu=64000000
itsybitsy52840.build.board=NRF52840_ITSYBITSY
itsybitsy52840.build.core=nRF5
itsybitsy52840.build.variant=itsybitsy_nrf52840_express
itsybitsy52840.build.variant_system_lib=
itsybitsy52840.build.usb_manufacturer="Adafruit"
itsybitsy52840.build.usb_product="ItsyBitsy nRF52840 Express"
itsybitsy52840.build.vid=0x239A
itsybitsy52840.build.pid=0x8051
itsybitsy52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
itsybitsy52840.build.ldscript=nrf52840_xxaa.ld
itsybitsy52840.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
itsybitsy52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

itsybitsy52840.menu.role.all=All
itsybitsy52840.menu.role.all.build.nimble_flags=
itsybitsy52840.menu.role.periph=Peripheral
itsybitsy52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
itsybitsy52840.menu.role.adv=Advertiser
itsybitsy52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
itsybitsy52840.menu.role.scan=Scanner
itsybitsy52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
itsybitsy52840.menu.role.central=Client
itsybitsy52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

