h2zero/n-able-Arduino/boards.txt
itsybitsy52840.menu.cppDbgLvl.none=None
itsybitsy52840.menu.cppDbgLvl.none.build.cpp_debug=0
itsybitsy52840.menu.cppDbgLvl.error=Error
itsybitsy52840.menu.cppDbgLvl.error.build.cpp_debug=1
itsybitsy52840.menu.cppDbgLvl.warn=Warn
itsybitsy52840.menu.cppDbgLvl.warn.build.cpp_debug=2
itsybitsy52840.menu.cppDbgLvl.info=Info
itsybitsy52840.menu.cppDbgLvl.info.build.cpp_debug=3
itsybitsy52840.menu.cppDbgLvl.debug=Debug
itsybitsy52840.menu.cppDbgLvl.debug.build.cpp_debug=4

itsybitsy52840.menu.bootloader.adafruit=Adafruit (No softdevice)
itsybitsy52840.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
itsybitsy52840.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
itsybitsy52840.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
itsybitsy52840.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
itsybitsy52840.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
itsybitsy52840.menu.bootloader.none=No bootloader
itsybitsy52840.menu.bootloader.none.bootloader.flags=
itsybitsy52840.menu.bootloader.none.upload.maximum_size=1048576


cplaynrf52840.name=Adafruit Circuit Playground Bluefruit

cplaynrf52840.vid.0=0x239A
cplaynrf52840.pid.0=0x8045
cplaynrf52840.vid.1=0x239A
cplaynrf52840.pid.1=0x0045
cplaynrf52840.vid.2=0x239A
cplaynrf52840.pid.2=0x8046

cplaynrf52840.upload.tool=openocd
cplaynrf52840.upload.target=nrf52
cplaynrf52840.upload.use_1200bps_touch=true
cplaynrf52840.upload.wait_for_upload_port=true
cplaynrf52840.upload.maximum_size=995328

cplaynrf52840.bootloader.tool=openocd

cplaynrf52840.build.mcu=cortex-m4
cplaynrf52840.build.f_cpu=64000000
cplaynrf52840.build.board=NRF52840_CIRCUITPLAY
cplaynrf52840.build.core=nRF5
cplaynrf52840.build.variant=circuitplayground_nrf52840
cplaynrf52840.build.variant_system_lib=
cplaynrf52840.build.usb_manufacturer="Adafruit"
cplaynrf52840.build.usb_product="Circuit Playground Bluefruit"
cplaynrf52840.build.vid=0x239A
cplaynrf52840.build.pid=0x8045
cplaynrf52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
cplaynrf52840.build.ldscript=nrf52840_xxaa.ld
cplaynrf52840.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
cplaynrf52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

cplaynrf52840.menu.role.all=All
cplaynrf52840.menu.role.all.build.nimble_flags=
cplaynrf52840.menu.role.periph=Peripheral
cplaynrf52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
cplaynrf52840.menu.role.adv=Advertiser
cplaynrf52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
cplaynrf52840.menu.role.scan=Scanner
cplaynrf52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
cplaynrf52840.menu.role.central=Client
cplaynrf52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

cplaynrf52840.menu.cppDbgLvl.none=None
cplaynrf52840.menu.cppDbgLvl.none.build.cpp_debug=0
cplaynrf52840.menu.cppDbgLvl.error=Error
cplaynrf52840.menu.cppDbgLvl.error.build.cpp_debug=1
cplaynrf52840.menu.cppDbgLvl.warn=Warn
cplaynrf52840.menu.cppDbgLvl.warn.build.cpp_debug=2
cplaynrf52840.menu.cppDbgLvl.info=Info
cplaynrf52840.menu.cppDbgLvl.info.build.cpp_debug=3
cplaynrf52840.menu.cppDbgLvl.debug=Debug
cplaynrf52840.menu.cppDbgLvl.debug.build.cpp_debug=4

cplaynrf52840.menu.bootloader.adafruit=Adafruit (No softdevice)
cplaynrf52840.menu.bootloader.adafruit.bootloader.flags=-DUSE_ADA_BL
cplaynrf52840.menu.bootloader.adafruit.upload.tool=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit.upload.protocol=adafruit-nrfutil
cplaynrf52840.menu.bootloader.adafruit.build.ldscript=nrf52_xxaa_adabl.ld
cplaynrf52840.menu.bootloader.adafruit.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}
cplaynrf52840.menu.bootloader.adafruit.build.bootloader.file=variants/{build.variant}/ada_bootloader.hex
cplaynrf52840.menu.bootloader.none=No bootloader
cplaynrf52840.menu.bootloader.none.bootloader.flags=
cplaynrf52840.menu.bootloader.none.upload.maximum_size=1048576


cluenrf52840.name=Adafruit CLUE

cluenrf52840.vid.0=0x239A
cluenrf52840.pid.0=0x8071
cluenrf52840.vid.1=0x239A
cluenrf52840.pid.1=0x0071
cluenrf52840.vid.2=0x239A
cluenrf52840.pid.2=0x8072

cluenrf52840.upload.tool=openocd
cluenrf52840.upload.target=nrf52
cluenrf52840.upload.use_1200bps_touch=true
cluenrf52840.upload.wait_for_upload_port=true
cluenrf52840.upload.maximum_size=995328

cluenrf52840.bootloader.tool=openocd

cluenrf52840.build.mcu=cortex-m4
cluenrf52840.build.f_cpu=64000000
cluenrf52840.build.board=NRF52840_CLUE
cluenrf52840.build.core=nRF5
cluenrf52840.build.variant=clue_nrf52840
cluenrf52840.build.variant_system_lib=
cluenrf52840.build.usb_manufacturer="Adafruit"
cluenrf52840.build.usb_product="CLUE"
cluenrf52840.build.vid=0x239A
cluenrf52840.build.pid=0x8071
cluenrf52840.build.float_flags=-mfloat-abi=hard -mfpu=fpv4-sp-d16
cluenrf52840.build.ldscript=nrf52840_xxaa.ld
cluenrf52840.build.extra_flags=-DNRF52_SERIES -DNRF52832_XXAA {bootloader.flags} {build.flags.usb} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}
cluenrf52840.build.dfu_pattern={adafruit-nrfutil.dfu_pattern}

cluenrf52840.menu.role.all=All
cluenrf52840.menu.role.all.build.nimble_flags=
cluenrf52840.menu.role.periph=Peripheral
cluenrf52840.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
cluenrf52840.menu.role.adv=Advertiser
cluenrf52840.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
cluenrf52840.menu.role.scan=Scanner
cluenrf52840.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
cluenrf52840.menu.role.central=Client
cluenrf52840.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

cluenrf52840.menu.cppDbgLvl.none=None
cluenrf52840.menu.cppDbgLvl.none.build.cpp_debug=0
cluenrf52840.menu.cppDbgLvl.error=Error
cluenrf52840.menu.cppDbgLvl.error.build.cpp_debug=1
cluenrf52840.menu.cppDbgLvl.warn=Warn
cluenrf52840.menu.cppDbgLvl.warn.build.cpp_debug=2
cluenrf52840.menu.cppDbgLvl.info=Info
cluenrf52840.menu.cppDbgLvl.info.build.cpp_debug=3
cluenrf52840.menu.cppDbgLvl.debug=Debug
cluenrf52840.menu.cppDbgLvl.debug.build.cpp_debug=4

