h2zero/n-able-Arduino/boards.txt
BBCmicrobit.menu.cppDbgLvl.none=None
BBCmicrobit.menu.cppDbgLvl.none.build.cpp_debug=0
BBCmicrobit.menu.cppDbgLvl.error=Error
BBCmicrobit.menu.cppDbgLvl.error.build.cpp_debug=1
BBCmicrobit.menu.cppDbgLvl.warn=Warn
BBCmicrobit.menu.cppDbgLvl.warn.build.cpp_debug=2
BBCmicrobit.menu.cppDbgLvl.info=Info
BBCmicrobit.menu.cppDbgLvl.info.build.cpp_debug=3
BBCmicrobit.menu.cppDbgLvl.debug=Debug
BBCmicrobit.menu.cppDbgLvl.debug.build.cpp_debug=4


Beacon_PCA20006.name=Nordic Beacon Kit (PCA20006)

Beacon_PCA20006.upload.tool=openocd
Beacon_PCA20006.upload.target=nrf51
Beacon_PCA20006.upload.maximum_size=262144

Beacon_PCA20006.bootloader.tool=openocd

Beacon_PCA20006.build.mcu=cortex-m0
Beacon_PCA20006.build.f_cpu=16000000
Beacon_PCA20006.build.board=BEACON_PCA20006
Beacon_PCA20006.build.core=nRF5
Beacon_PCA20006.build.variant=PCA20006
Beacon_PCA20006.build.variant_system_lib=
Beacon_PCA20006.build.float_flags=
Beacon_PCA20006.build.ldscript=nrf51_xxaa.ld
Beacon_PCA20006.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Beacon_PCA20006.menu.role.all=All
Beacon_PCA20006.menu.role.all.build.nimble_flags=
Beacon_PCA20006.menu.role.periph=Peripheral
Beacon_PCA20006.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Beacon_PCA20006.menu.role.adv=Advertiser
Beacon_PCA20006.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Beacon_PCA20006.menu.role.scan=Scanner
Beacon_PCA20006.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Beacon_PCA20006.menu.role.central=Client
Beacon_PCA20006.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Beacon_PCA20006.menu.cppDbgLvl.none=None
Beacon_PCA20006.menu.cppDbgLvl.none.build.cpp_debug=0
Beacon_PCA20006.menu.cppDbgLvl.error=Error
Beacon_PCA20006.menu.cppDbgLvl.error.build.cpp_debug=1
Beacon_PCA20006.menu.cppDbgLvl.warn=Warn
Beacon_PCA20006.menu.cppDbgLvl.warn.build.cpp_debug=2
Beacon_PCA20006.menu.cppDbgLvl.info=Info
Beacon_PCA20006.menu.cppDbgLvl.info.build.cpp_debug=3
Beacon_PCA20006.menu.cppDbgLvl.debug=Debug
Beacon_PCA20006.menu.cppDbgLvl.debug.build.cpp_debug=4


BLENano.name=RedBearLab BLE Nano

BLENano.upload.tool=openocd
BLENano.upload.target=nrf51
BLENano.upload.maximum_size=262144
BLENano.upload.protocol=cmsis-dap
BLENano.upload.setup_command=transport select swd;

BLENano.bootloader.tool=openocd

BLENano.build.mcu=cortex-m0
BLENano.build.f_cpu=16000000
BLENano.build.board=BLE_NANO
BLENano.build.core=nRF5
BLENano.build.variant=BLENano
BLENano.build.variant_system_lib=
BLENano.build.float_flags=
BLENano.build.ldscript=nrf51_{build.chip}.ld
BLENano.build.extra_flags=-DNRF51 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BLENano.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
BLENano.menu.chip.xxaa.build.chip=xxaa
BLENano.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
BLENano.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
BLENano.menu.chip.xxac.build.chip=xxac
BLENano.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

BLENano.menu.role.all=All
BLENano.menu.role.all.build.nimble_flags=
BLENano.menu.role.periph=Peripheral
BLENano.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BLENano.menu.role.adv=Advertiser
BLENano.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BLENano.menu.role.scan=Scanner
BLENano.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BLENano.menu.role.central=Client
BLENano.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BLENano.menu.cppDbgLvl.none=None
BLENano.menu.cppDbgLvl.none.build.cpp_debug=0
BLENano.menu.cppDbgLvl.error=Error
BLENano.menu.cppDbgLvl.error.build.cpp_debug=1
BLENano.menu.cppDbgLvl.warn=Warn
BLENano.menu.cppDbgLvl.warn.build.cpp_debug=2
BLENano.menu.cppDbgLvl.info=Info
BLENano.menu.cppDbgLvl.info.build.cpp_debug=3
BLENano.menu.cppDbgLvl.debug=Debug
BLENano.menu.cppDbgLvl.debug.build.cpp_debug=4


BluzDK.name=BluzDK

BluzDK.upload.tool=openocd
BluzDK.upload.target=nrf51
BluzDK.upload.maximum_size=262144

BluzDK.bootloader.tool=openocd

BluzDK.build.mcu=cortex-m0
BluzDK.build.f_cpu=16000000
BluzDK.build.board=BLUZ_DK
BluzDK.build.core=nRF5
BluzDK.build.variant=BluzDK
BluzDK.build.variant_system_lib=
BluzDK.build.float_flags=
BluzDK.build.ldscript=nrf51_xxaa.ld
BluzDK.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

BluzDK.menu.role.all=All
BluzDK.menu.role.all.build.nimble_flags=
BluzDK.menu.role.periph=Peripheral
BluzDK.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
BluzDK.menu.role.adv=Advertiser
BluzDK.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
BluzDK.menu.role.scan=Scanner
BluzDK.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
BluzDK.menu.role.central=Client
BluzDK.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

BluzDK.menu.cppDbgLvl.none=None
BluzDK.menu.cppDbgLvl.none.build.cpp_debug=0
BluzDK.menu.cppDbgLvl.error=Error
BluzDK.menu.cppDbgLvl.error.build.cpp_debug=1
BluzDK.menu.cppDbgLvl.warn=Warn
BluzDK.menu.cppDbgLvl.warn.build.cpp_debug=2
BluzDK.menu.cppDbgLvl.info=Info
BluzDK.menu.cppDbgLvl.info.build.cpp_debug=3
BluzDK.menu.cppDbgLvl.debug=Debug
BluzDK.menu.cppDbgLvl.debug.build.cpp_debug=4


