h2zero/n-able-Arduino/boards.txt
CalliopeMini.name=Calliope mini

CalliopeMini.vid.0=0x0d28
CalliopeMini.pid.0=0x0204

CalliopeMini.upload.tool=openocd
CalliopeMini.upload.protocol=cmsis-dap
CalliopeMini.upload.target=nrf51
CalliopeMini.upload.maximum_size=262144
CalliopeMini.upload.setup_command=transport select swd;

CalliopeMini.bootloader.tool=openocd

CalliopeMini.build.mcu=cortex-m0
CalliopeMini.build.f_cpu=16000000
CalliopeMini.build.board=CALLIOPE_MINI
CalliopeMini.build.core=nRF5
CalliopeMini.build.variant=CalliopeMini
CalliopeMini.build.variant_system_lib=
CalliopeMini.build.float_flags=
CalliopeMini.build.ldscript=nrf51_xxaa.ld
CalliopeMini.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

CalliopeMini.menu.role.all=All
CalliopeMini.menu.role.all.build.nimble_flags=
CalliopeMini.menu.role.periph=Peripheral
CalliopeMini.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
CalliopeMini.menu.role.adv=Advertiser
CalliopeMini.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
CalliopeMini.menu.role.scan=Scanner
CalliopeMini.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
CalliopeMini.menu.role.central=Client
CalliopeMini.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

CalliopeMini.menu.cppDbgLvl.none=None
CalliopeMini.menu.cppDbgLvl.none.build.cpp_debug=0
CalliopeMini.menu.cppDbgLvl.error=Error
CalliopeMini.menu.cppDbgLvl.error.build.cpp_debug=1
CalliopeMini.menu.cppDbgLvl.warn=Warn
CalliopeMini.menu.cppDbgLvl.warn.build.cpp_debug=2
CalliopeMini.menu.cppDbgLvl.info=Info
CalliopeMini.menu.cppDbgLvl.info.build.cpp_debug=3
CalliopeMini.menu.cppDbgLvl.debug=Debug
CalliopeMini.menu.cppDbgLvl.debug.build.cpp_debug=4


ng_beacon.name=ng-beacon

ng_beacon.upload.tool=openocd
ng_beacon.upload.target=nrf51
ng_beacon.upload.maximum_size=262144

ng_beacon.bootloader.tool=openocd

ng_beacon.build.mcu=cortex-m0
ng_beacon.build.f_cpu=16000000
ng_beacon.build.board=NG_BEACON
ng_beacon.build.core=nRF5
ng_beacon.build.variant=ng-beacon
ng_beacon.build.variant_system_lib=
ng_beacon.build.float_flags=
ng_beacon.build.ldscript=nrf51_xxaa.ld
ng_beacon.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

ng_beacon.menu.role.all=All
ng_beacon.menu.role.all.build.nimble_flags=
ng_beacon.menu.role.periph=Peripheral
ng_beacon.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
ng_beacon.menu.role.adv=Advertiser
ng_beacon.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
ng_beacon.menu.role.scan=Scanner
ng_beacon.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
ng_beacon.menu.role.central=Client
ng_beacon.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

ng_beacon.menu.cppDbgLvl.none=None
ng_beacon.menu.cppDbgLvl.none.build.cpp_debug=0
ng_beacon.menu.cppDbgLvl.error=Error
ng_beacon.menu.cppDbgLvl.error.build.cpp_debug=1
ng_beacon.menu.cppDbgLvl.warn=Warn
ng_beacon.menu.cppDbgLvl.warn.build.cpp_debug=2
ng_beacon.menu.cppDbgLvl.info=Info
ng_beacon.menu.cppDbgLvl.info.build.cpp_debug=3
ng_beacon.menu.cppDbgLvl.debug=Debug
ng_beacon.menu.cppDbgLvl.debug.build.cpp_debug=4


nRF51Dongle.name=Nordic nRF51 Dongle

nRF51Dongle.upload.tool=openocd
nRF51Dongle.upload.target=nrf51
nRF51Dongle.upload.maximum_size=262144
nRF51Dongle.upload.protocol=cmsis-dap
nRF51Dongle.upload.setup_command=transport select swd;

nRF51Dongle.bootloader.tool=openocd

nRF51Dongle.build.mcu=cortex-m0
nRF51Dongle.build.f_cpu=16000000
nRF51Dongle.build.board=NRF51_DONGLE
nRF51Dongle.build.core=nRF5
nRF51Dongle.build.variant=nRF51_Dongle
nRF51Dongle.build.variant_system_lib=
nRF51Dongle.build.float_flags=
nRF51Dongle.build.ldscript=nrf51_xxac.ld
nRF51Dongle.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=32 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

nRF51Dongle.menu.role.all=All
nRF51Dongle.menu.role.all.build.nimble_flags=
nRF51Dongle.menu.role.periph=Peripheral
nRF51Dongle.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
nRF51Dongle.menu.role.adv=Advertiser
nRF51Dongle.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
nRF51Dongle.menu.role.scan=Scanner
nRF51Dongle.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
nRF51Dongle.menu.role.central=Client
nRF51Dongle.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

nRF51Dongle.menu.cppDbgLvl.none=None
nRF51Dongle.menu.cppDbgLvl.none.build.cpp_debug=0
nRF51Dongle.menu.cppDbgLvl.error=Error
nRF51Dongle.menu.cppDbgLvl.error.build.cpp_debug=1
nRF51Dongle.menu.cppDbgLvl.warn=Warn
nRF51Dongle.menu.cppDbgLvl.warn.build.cpp_debug=2
nRF51Dongle.menu.cppDbgLvl.info=Info
nRF51Dongle.menu.cppDbgLvl.info.build.cpp_debug=3
nRF51Dongle.menu.cppDbgLvl.debug=Debug
nRF51Dongle.menu.cppDbgLvl.debug.build.cpp_debug=4


OSHChip.name=OSHChip

OSHChip.upload.tool=openocd
OSHChip.upload.target=nrf51
OSHChip.upload.maximum_size=262144

OSHChip.bootloader.tool=openocd

OSHChip.build.mcu=cortex-m0
OSHChip.build.f_cpu=16000000
OSHChip.build.board=OSHCHIP
OSHChip.build.core=nRF5
OSHChip.build.variant=OSHChip
OSHChip.build.variant_system_lib=
OSHChip.build.float_flags=
OSHChip.build.ldscript=nrf51_xxac.ld
OSHChip.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=32 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

