h2zero/n-able-Arduino/boards.txt
OSHChip.menu.role.all=All
OSHChip.menu.role.all.build.nimble_flags=
OSHChip.menu.role.periph=Peripheral
OSHChip.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
OSHChip.menu.role.adv=Advertiser
OSHChip.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
OSHChip.menu.role.scan=Scanner
OSHChip.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
OSHChip.menu.role.central=Client
OSHChip.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

OSHChip.menu.cppDbgLvl.none=None
OSHChip.menu.cppDbgLvl.none.build.cpp_debug=0
OSHChip.menu.cppDbgLvl.error=Error
OSHChip.menu.cppDbgLvl.error.build.cpp_debug=1
OSHChip.menu.cppDbgLvl.warn=Warn
OSHChip.menu.cppDbgLvl.warn.build.cpp_debug=2
OSHChip.menu.cppDbgLvl.info=Info
OSHChip.menu.cppDbgLvl.info.build.cpp_debug=3
OSHChip.menu.cppDbgLvl.debug=Debug
OSHChip.menu.cppDbgLvl.debug.build.cpp_debug=4


RedBearLab_nRF51822.name=RedBearLab nRF51822

RedBearLab_nRF51822.upload.tool=openocd
RedBearLab_nRF51822.upload.target=nrf51
RedBearLab_nRF51822.upload.maximum_size=262144
RedBearLab_nRF51822.upload.protocol=cmsis-dap
RedBearLab_nRF51822.upload.setup_command=transport select swd;

RedBearLab_nRF51822.bootloader.tool=openocd

RedBearLab_nRF51822.build.mcu=cortex-m0
RedBearLab_nRF51822.build.f_cpu=16000000
RedBearLab_nRF51822.build.board=REDBEARLAB_NRF51822
RedBearLab_nRF51822.build.core=nRF5
RedBearLab_nRF51822.build.variant=RedBearLab_nRF51822
RedBearLab_nRF51822.build.variant_system_lib=
RedBearLab_nRF51822.build.float_flags=
RedBearLab_nRF51822.build.ldscript=nrf51_{build.chip}.ld
RedBearLab_nRF51822.build.extra_flags=-DNRF51 {build.ram_size} -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

RedBearLab_nRF51822.menu.chip.xxaa=16 kB RAM, 256 kB flash (xxaa)
RedBearLab_nRF51822.menu.chip.xxaa.build.chip=xxaa
RedBearLab_nRF51822.menu.chip.xxaa.build.ram_size=-DDEVICE_RAM_SIZE=16
RedBearLab_nRF51822.menu.chip.xxac=32 kB RAM, 256 kB flash (xxac)
RedBearLab_nRF51822.menu.chip.xxac.build.chip=xxac
RedBearLab_nRF51822.menu.chip.xxac.build.ram_size=-DDEVICE_RAM_SIZE=32

RedBearLab_nRF51822.menu.role.all=All
RedBearLab_nRF51822.menu.role.all.build.nimble_flags=
RedBearLab_nRF51822.menu.role.periph=Peripheral
RedBearLab_nRF51822.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
RedBearLab_nRF51822.menu.role.adv=Advertiser
RedBearLab_nRF51822.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
RedBearLab_nRF51822.menu.role.scan=Scanner
RedBearLab_nRF51822.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
RedBearLab_nRF51822.menu.role.central=Client
RedBearLab_nRF51822.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

RedBearLab_nRF51822.menu.cppDbgLvl.none=None
RedBearLab_nRF51822.menu.cppDbgLvl.none.build.cpp_debug=0
RedBearLab_nRF51822.menu.cppDbgLvl.error=Error
RedBearLab_nRF51822.menu.cppDbgLvl.error.build.cpp_debug=1
RedBearLab_nRF51822.menu.cppDbgLvl.warn=Warn
RedBearLab_nRF51822.menu.cppDbgLvl.warn.build.cpp_debug=2
RedBearLab_nRF51822.menu.cppDbgLvl.info=Info
RedBearLab_nRF51822.menu.cppDbgLvl.info.build.cpp_debug=3
RedBearLab_nRF51822.menu.cppDbgLvl.debug=Debug
RedBearLab_nRF51822.menu.cppDbgLvl.debug.build.cpp_debug=4


Sinobit.name=Sino:bit

Sinobit.vid.0=0x0d28
Sinobit.pid.0=0x0204

Sinobit.upload.tool=openocd
Sinobit.upload.target=nrf51
Sinobit.upload.maximum_size=262144
Sinobit.upload.protocol=cmsis-dap
Sinobit.upload.setup_command=transport select swd;

Sinobit.bootloader.tool=openocd

Sinobit.build.mcu=cortex-m0
Sinobit.build.f_cpu=16000000
Sinobit.build.board=SINOBIT
Sinobit.build.core=nRF5
Sinobit.build.variant=Sinobit
Sinobit.build.variant_system_lib=
Sinobit.build.float_flags=
Sinobit.build.ldscript=nrf51_xxaa.ld
Sinobit.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

Sinobit.menu.role.all=All
Sinobit.menu.role.all.build.nimble_flags=
Sinobit.menu.role.periph=Peripheral
Sinobit.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
Sinobit.menu.role.adv=Advertiser
Sinobit.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
Sinobit.menu.role.scan=Scanner
Sinobit.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
Sinobit.menu.role.central=Client
Sinobit.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

Sinobit.menu.cppDbgLvl.none=None
Sinobit.menu.cppDbgLvl.none.build.cpp_debug=0
Sinobit.menu.cppDbgLvl.error=Error
Sinobit.menu.cppDbgLvl.error.build.cpp_debug=1
Sinobit.menu.cppDbgLvl.warn=Warn
Sinobit.menu.cppDbgLvl.warn.build.cpp_debug=2
Sinobit.menu.cppDbgLvl.info=Info
Sinobit.menu.cppDbgLvl.info.build.cpp_debug=3
Sinobit.menu.cppDbgLvl.debug=Debug
Sinobit.menu.cppDbgLvl.debug.build.cpp_debug=4


TinyBLE.name=TinyBLE

TinyBLE.upload.tool=openocd
TinyBLE.upload.target=nrf51
TinyBLE.upload.maximum_size=262144
TinyBLE.upload.protocol=cmsis-dap
TinyBLE.upload.setup_command=transport select swd;

TinyBLE.bootloader.tool=openocd

TinyBLE.build.mcu=cortex-m0
TinyBLE.build.f_cpu=16000000
TinyBLE.build.board=TINYBLE
TinyBLE.build.core=nRF5
TinyBLE.build.variant=TinyBLE
TinyBLE.build.variant_system_lib=
TinyBLE.build.float_flags=
TinyBLE.build.ldscript=nrf51_xxaa.ld
TinyBLE.build.extra_flags=-DNRF51 -DDEVICE_RAM_SIZE=16 -DCONFIG_NIMBLE_CPP_LOG_LEVEL={build.cpp_debug} {build.nimble_flags}

TinyBLE.menu.role.all=All
TinyBLE.menu.role.all.build.nimble_flags=
TinyBLE.menu.role.periph=Peripheral
TinyBLE.menu.role.periph.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED
TinyBLE.menu.role.adv=Advertiser
TinyBLE.menu.role.adv.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_OBSERVER_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED
TinyBLE.menu.role.scan=Scanner
TinyBLE.menu.role.scan.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_CENTRAL_DISABLED
TinyBLE.menu.role.central=Client
TinyBLE.menu.role.central.build.nimble_flags=-DCONFIG_BT_NIMBLE_ROLE_PERIPHERAL_DISABLED -DCONFIG_BT_NIMBLE_ROLE_BROADCASTER_DISABLED

